# Pandas DataFrame replace values using where

In [1]:
import pandas as pd

In [2]:
technologies= {
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas"],
    'Fee' :[22000,25000,23000,24000,26000],
    'Discount':[1500,1000,1200,800,1300],
    'Duration':['30days','50days','30days', '35days', '40days']
           }

In [3]:
technologies

{'Courses': ['Spark', 'PySpark', 'Hadoop', 'Python', 'Pandas'],
 'Fee': [22000, 25000, 23000, 24000, 26000],
 'Discount': [1500, 1000, 1200, 800, 1300],
 'Duration': ['30days', '50days', '30days', '35days', '40days']}

In [4]:
data = pd.DataFrame(technologies)

In [5]:
data

   Courses    Fee  Discount Duration
0    Spark  22000      1500   30days
1  PySpark  25000      1000   50days
2   Hadoop  23000      1200   30days
3   Python  24000       800   35days
4   Pandas  26000      1300   40days

In [6]:
data["Fee"] >= 25000

0    False
1     True
2    False
3    False
4     True
Name: Fee, dtype: bool

In [7]:
data[data["Fee"] >= 25000]

   Courses    Fee  Discount Duration
1  PySpark  25000      1000   50days
4   Pandas  26000      1300   40days

In [8]:
data.loc[data["Fee"] >= 25000]

   Courses    Fee  Discount Duration
1  PySpark  25000      1000   50days
4   Pandas  26000      1300   40days

In [9]:
data.loc[data["Fee"] >= 25000] = 30000

In [10]:
data # Here values of pyspark and pandas are changed. But the course name also get changed.

  Courses    Fee  Discount Duration
0   Spark  22000      1500   30days
1   30000  30000     30000    30000
2  Hadoop  23000      1200   30days
3  Python  24000       800   35days
4   30000  30000     30000    30000

In [13]:
np.where?

Docstring:
where(condition, [x, y])

Return elements chosen from `x` or `y` depending on `condition`.

.. note::
    When only `condition` is provided, this function is a shorthand for
    ``np.asarray(condition).nonzero()``. Using `nonzero` directly should be
    preferred, as it behaves correctly for subclasses. The rest of this
    documentation covers only the case where all three arguments are
    provided.

Parameters
----------
condition : array_like, bool
    Where True, yield `x`, otherwise yield `y`.
x, y : array_like
    Values from which to choose. `x`, `y` and `condition` need to be
    broadcastable to some shape.

Returns
-------
out : ndarray
    An array with elements from `x` where `condition` is True, and elements
    from `y` elsewhere.

See Also
--------
choose
nonzero : The function that is called when x and y are omitted

Notes
-----
If all the arrays are 1-D, `where` is equivalent to::

    [xv if c else yv
     for c, xv, yv in zip(condition, x, y)]

Examples
--------
>>> a = np.arange(10)
>>> a
array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])
>>> np.where(a < 5, a, 10*a)
array([ 0,  1,  2,  3,  4, 50, 60, 70, 80, 90])

This can be used on multidimensional arrays too:

>>> np.where([[True, False], [True, True]],
...          [[1, 2], [3, 4]],
...          [[9, 8], [7, 6]])
array([[1, 8],
       [3, 4]])

The shapes of x, y, and the condition are broadcast together:

>>> x, y = np.ogrid[:3, :4]
>>> np.where(x < y, x, 10 + y)  # both x and 10+y are broadcast
array([[10,  0,  0,  0],
       [10, 11,  1,  1],
       [10, 11, 12,  2]])

>>> a = np.array([[0, 1, 2],
...               [0, 2, 4],
...               [0, 3, 6]])
>>> np.where(a < 4, a, -1)  # -1 is broadcast
array([[ 0,  1,  2],
       [ 0,  2, -1],
       [ 0,  3, -1]])
Type:      function

In [14]:
x = [i for i in range(10)]

In [15]:
x

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [16]:
x = np.array(x)

In [17]:
x

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [18]:
# Value of x is less than 5 means, print the value else print the value x+10

In [19]:
np.where(x <  5, x, x + 10 )

array([ 0,  1,  2,  3,  4, 15, 16, 17, 18, 19])

In [20]:
data

  Courses    Fee  Discount Duration
0   Spark  22000      1500   30days
1   30000  30000     30000    30000
2  Hadoop  23000      1200   30days
3  Python  24000       800   35days
4   30000  30000     30000    30000

# Another method

In [23]:
technologies= {
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas"],
    'Fee' :[22000,25000,23000,24000,26000],
    'Discount':[1500,1000,1200,800,1300],
    'Duration':['30days','50days','30days', '35days', '40days']
           }

In [24]:
data = pd.DataFrame(technologies)

In [27]:
data["Fee"] = np.where(data["Fee"] >= 25000, 30000, data["Fee"])

In [28]:
data

   Courses    Fee  Discount Duration
0    Spark  22000      1500   30days
1  PySpark  30000      1000   50days
2   Hadoop  23000      1200   30days
3   Python  24000       800   35days
4   Pandas  30000      1300   40days